{
	"program_slug": "full-stack",
	"school_slug": "ironhack",
	"cities": ["Miami", "MexicoCity", "SaoPablo", "Madrid", "Barcelona", "Amsterdam", "Berlin", "Paris"],
	"focus": "WebDevelopment",
	"price": {
		"financing": false,
		"finance_max_length_in_months": 36,
		"finance_min_length_in_months": 6,
		"avg_usd_price_monthly": 364,
		"avg_usd_price_upfront": 12000
	},
	"time_commitment": ["part-time-inmersive"],
	"learning-style": {
		"one_on_one_mentorship": true,
		"online_exercises": true,
		"description": "Remote Prework, In-Person Training, Classes schedule is from Mon & Wed, 6:30 pm - 9:30 pm, Sat 10:00 am - 5:00 pm"
	},
	"online-platform": true,
	"syllabus": {
		"topics": ["Java Script", "React", "Node", "ExpressJs", "AngularJs", "MongoDB", "API", "Passport"],
		"skills": ["Front-End Web Development", "Advanced MEAN stack", "Web Service Applications"]
	},
	"mentors": {
		"industry_influencers": false
	},
	"placement_rate": 85,
	"post_graduate_support": {
		"job_support": true,
		"job_support_length_in_days": 90
	},
	"job_guarantee": {
		"refund": true,
		"defered": true
	},
	"pre_work": {
		"avg_length_in_days": null,
		"avg_length_in_hours": 60,
		"technologies": ["html", "css", "JavaScript", "Github"],
		"description": "Prework is mandatory, it consist in 60 hours os online web content"
	},
	"scolarships": {
		"for_woman": true,
		"for_veterans": true,
		"other": "none"
	},
	"application_process": {
		"avg_length_in_days": 15,
		"includes_tests": true,
		"includes_interviews": true,
		"description": "Online Application, Personal Interview, Technical Assessment, Deposit and Prework"
	},
	"reviews": {
		"switch_up": 4.9,
		"course_report": 4.8,
		"google": 4.6,
		"the_worse": [{
				"description": "The Good, The Bad, The Ugly. Pros: Great school. Alan and Brito were great! Free beer, coffee, snacks, and the occasional pizza is available for all student. I got many many many job interviews and was able to get a job offer within 3 weeks after graduation. Cons: The curriculum was not so great. Typos, outdated instructions, some lessons were skipped, and you had to wait for the class teacher to troubleshoot the LESSONS GIVEN TO YOU BY IRONHACK because they were incorrect. But my biggest gripe was that the lesson instructions were outdated. If you followed some of the instructions step-by-step, your app would fail. This was incredibly frustrating. You couldn't really study at home because you couldn't trust the instructions. You'd had to wait for class to find out if the material GIVEN to you was either correct or incorrect. I hated that because I paid a ton of money and I received sub-par class materials. If it wasn't for Alan's fast troubleshooting and helpful guidance to overcome the incorrect provided instructions, by whoever wrote the curriculum directions, as well as Brito's amazing help to find me a job fast AND my very own will to invest extra money in outside sources like Pluralsight, Codeacadamy, and books, I would have given IRONHACK a piece of my mind and legally disputed the payment sent to them. My recommendation to IRONHACK is to replace whoever wrote the instructions that we followed daily in class with someone who is more dedicated to double-checking their work. Class instructions need to be accurate and easily readable. Memes and incorrect instructions don't teach us anything. I also hope the class materials, that I PAID for, are updated continuously as time goes by. The instructions are ONLINE for god's sakes. I'm an alumnus of this school and as a customer who paid money, I should be able to go back to the material to study without worrying that my course materials are outdated or forgotten, even 5 years later. Everyone should have access to the same material whether you're from the first class ever in Ironhack to the 50th. If you update the instructions, it should update for ALL who have access to the student portal. In conclusion: The school is overall great. Alan and Brito were amazing and have earned my respect and it's because of their great work ethic that I did not raise hell. I couldn't say the same for the person who wrote the instructions found in http://learn.ironhack.com/ If you're a student, I recommend you review the course material within the first week with someone else to make sure your material is correct. So that if it is not accurate, you ask for a refund without issue. Thanks for everything.",
				"full_name": "Aaron Molina",
				"url": "https://www.switchup.org/bootcamps/ironhack?ratings=3",
				"score": 3
			},
			{
				"description": "TERRIBLE FOR A TECH COMPANY!!! They have been sending me unsolicited e mails for some time. i HAVE SENT THEM E MAILS TO STOP, LEFT MESSAGES ALSO. THE AUTO BUTTON DOES NOT WORK AND THE AUTO E MAIL TO SENDER DOES NOT WORK. why would you possibly want to even consider this place when there are so many better who can actually manage their own businesses? So happy we sent our son elsewhere.",
				"full_name": "Phil Antia",
				"url": "https://www.google.co.ve/search?q=iron+hack+miami&oq=iron+hack+miami&aqs=chrome..69i57j69i60l3j0.1898j0j4&sourceid=chrome&ie=UTF-8#lrd=0x88d9b685aa05d4e5:0xa0bda5d9915b7493,1",
				"score": 1
			}
		],
		"the_best": [{
				"description": "I was a digital artist who worked as a full time freelancer. So coding was not something I was very familiar with. <br /> IronHack helped me to learn the basics of coding during the first week. It is really impressive how fast the bootcamp guides you through the topics until you start learning some complex frameworks in a short period of time.<br /> I was able to find a job during the ironhack's event: 'Hiring Week' where I was able to solve coding test of many companies.<br />For someone who had no proffesional experience in coding, finding a job after 2 weeks was something unbelivable.<br />I really recommend this bootcamp for people who wants to switch their professional career. I was able to duplicate my income in a very short time.<br />Aside from the job part. The people I met in this bootcamp were very kind. The lead teacher and teacher assistants were always there to help me in the projects of the bootcamp. And the more experienced colleagues were also happy to help.",
				"full_name": "Alejandro Santamaria Gomez",
				"url": "https://www.switchup.org/bootcamps/ironhack?course=67",
				"score": 5
			},
			{
				"description": "I decided to enroll Ironhack after a year struggling to learn to code by myself. The online courses will teach you a lot but there's one and the biggest advantage of live word and that is - that’s able to teach you to develop not just your skills but your mindset as well. Speaking about that, the best thing for me was getting the ability to learn how to actually learn to code and how to find good resources which gives me opportunity to gain new skill sets now on my own. The people working in Ironhack are super friendly and always available to meet you on any way - to share their knowledge, their experiences and their resources with us. Out TA was Nick Borbe, truly amazing man who dedicated himself the most during our cohort and spent a lot after hours with us, especially during our final project weeks. Big thanks to this awesome guy! Speaking of people who gave the most knowledge and their precious time to us, besides Nick, there’s one more name there - Nizar. His pure passion for this profession can be seen and felt from the far, and his ability to solve your issues just by taking a short look at your code is just amazing. In the very end, there was the hiring fair. Our placement manager Daniel Brito gave us a lot of useful instructions and we spent a week preparing for the upcoming interviews with him and his guest speakers. So overall, I don’t regret a second for choosing Ironhack. Spending six months with a group of great people who share the same passion and taking this road with them, was the best decision I made. I would highly recommend taking this course to anyone who has interest and passion for web development.",
				"full_name": "Aleksandra Boskovic",
				"url": "https://www.coursereport.com/schools/ironhack#/reviews",
				"score": 4.5
			}
		]
	}
}