{
	"program_slug": "full-stack",
	"school_slug": "fullstack_academy",
	"cities": ["New York City", "Chicago"],
	"focus": ["SoftwareDevelopment"],
	"price": {
		"financing": true,
		"finance_max_length_in_months": 60,
		"finance_min_length_in_months": "Not avaiable",
		"avg_usd_price_monthly": 354,
		"avg_usd_price_upfront": 15680
	},
	"time_commitment": ["part-time-inmersive"],
	"learning-style": {
		"one_on_one_mentorship": true,
		"online_exercises": true,
		"description": "Classes are two weeknights each week at the Fullstack Academy campus, one weeknight each week remotely, and one full weekend each month. The on-campus portion s where students learn Fullstack's core curriculum through lectures, workshops, pair programming and office hours."
	},
	"online-platform": true,
	"syllabus": {
		"topics": ["HTML", "CSS", "JQuery", "JavaScript", "DOM", "ReactJS", "ExpressJS", "Database", "SQL", "NodeJS", "AJAX", "GIT"],
		"skills": ["Front-end Development", "Back-end Development", "Databases", "Real-world coding tools management"]
	},
	"mentors": {
		"industry_influencers": false
	},
	"placement_rate": 98,
	"post_graduate_support": {
		"job_support": true,
		"job_support_length_in_days": 90,
		"other": "during the Program"
	},
	"job_guarantee": {
		"refund": false,
		"defered": false
	},
	"pre_work": {
		"avg_length_in_days": 4,
		"technologies": ["html", "css", "JavaScript", "jQuery", "Programming foundations"],
		"description": "Online only, through a mix of live lectures, videos and exercises"
	},
	"scolarships": {
		"for_woman": true,
		"for_veterans": true,
		"other": "1) Needs-based partial scholarships for exceptional candidates who can demonstrate financial need. 2)The 50 States of Code fund offers a scholarship for their Remote Bootcamp Prep course. 3)$3,000 scholarship given to every immersive student at Fullstack Chicago."
	},
	"application_process": {
		"avg_length_in_days": 15,
		"includes_tests": true,
		"includes_interviews": true,
		"description": "Step 1: The prospective student submits an online application. <br /> Step 2: The student completes an online technical skills assessment after <br />receiving time and materials to prepare. <br /> Step 3: A face-to-face interview is scheduled over video conference to gather a preliminary understanding of the candidate’s background and motivations for applying to Fullstack Academy"
	},
	"reviews": {
		"switch_up": 4.9,
		"course_report": 4.8,
		"google": "not avaiable",
		"the_worse": [{
				"description": "Total ripoff: I was in the October 2017 cohort. It’s been over 6 months since we graduated the program, and I’ve tracked the progress of almost everyone from my cohort — maybe 50% max have been able to find jobs in the industry with an average salary of around $50-60k/year (estimates taken from Paysa and Glassdoor). The rest have mostly returned to their old jobs or moved in with their parents. Most of the instructors were people who had gone through the bootcamp themselves and had zero real-world software engineering experience. We spent a majority of the time pair programming i.e., having concepts explained to you by people who understand web development possibly even less than you do. Most of the few people I know who did manage to get decent jobs either had prior experience or a CS degree...",
				"full_name": "Anonymous",
				"url": "https://www.switchup.org/bootcamps/fullstack-academy?ratings=1",
				"score": 1
			},
			{
				"description": "I did Fullstack's flex program (nights and weekends) and would not recommend it. I would recommend Fullstack Academy. The instructors are great. They're all knowlegable and nice folks. <br />You're learning node. Node.js is, in my opinion, a better language to learn than ruby on rails, which a lot of other bootcamps teach. Node does a better job of handling single-page-applications, which is where tech is headed. Also, if you know node, you know both frontend and backend. <br />The cirriculum is good. It's not great, but I doubt any of the other options are better, unless you spend the time to go and get a degree. There is only so much you can learn in three months (or 6 months part time). That being said, avoid the flex program. I did the flex program, and I felt like the red-headed stepchild of FSA. First of all, you don't get as much. There is less classroom time than the fulltime program. They tell you that you're supposed to review on your own of the off days, but if you're doing flex you probably have a job (and a life) and don't have a lot of extra time. There are significantly fewer resources available to you, simply because everybody has gone home. By the time you get there, the instructors/staff have already put in 9+ hours and are ready to leave. So you don't have the ability to get that extra insight/different viewpoint. <br />There are a lot of great things that FSA offers, like guest lectures and hackathons, but they all happen during the day. If you can make it, great, but if you have a job you're outta luck. They just don't cover as much. This goes back to the classroom hours. I heard from a graduate who went on to be a teaching fellow that the fulltime class went deeper into the material because they had the time to really jump in. <br />And they charge you the same amount. If I had paid less for the flex, I wouldn't be upset because I would have gotten what I paid for. But no, it's that same hefty price tag for a fraction of the experience.",
				"full_name": "Anonymous",
				"url": "https://www.coursereport.com/schools/fullstack-academy#/reviews",
				"score": 4
			}
		],
		"the_best": [{
				"description": "Fullstack Academy's part-time Flex immersive was one of the most wonderful, worthwhile, and challenging experiences of my life. While there were some things that could be improved about the course, I can wholeheartedly say that everyone there is dedicated, intelligent, and fantastic. If you're thinking of applying to Fullstack, don't hesitate--you won't regret it! Application: Applying to Fullstack was fairly straightforward. After filling out an online form and taking an online assessment, I was then contacted for a one-on-one interview with a teaching fellow. The interview consisted of two parts--behavioral and technical. Don't sweat the technical interview. They're not looking for experts, but rather that you have a good grasp of the fundamentals and can handle instruction/feedback if you get stuck. Do not go in with 0 experience first, though. You need to, at minimum, understand the basics of JavaScript: variables, functions, arrays, loops, objects, conditionals, some recursion, etc. If you're on Code Wars, you should be able to solve level 6 problems with some regularity. The Class: The Flex immersive runs twice a week in-person and one weekend a month. A block of time is set aside for remote work/homework on Wednesdays, though there is no lecture during this time. The class runs across two phases: a junior phase, which consists mostly of lectures and workshops, and a senior phase, which is when you'll build applications from scratch. Eric Katz, the lead Flex instructor, is funny, insightful, and an all-around great guy. He's a brilliant engineer and teacher, and you'll be glad to have him as your mentor. The curriculum itself is challenging and trying--as it should be. Initially, I had panicked and thought I'd fail, but I realized quickly that I'd be okay so long as I put in the time and effort. Every concept you learn in the curriculum is then reinforced in senior phase, which is when you go from a newbie to a software engineer by building real apps--from a shopping website to your own hackathon project to a fully realized final project. The curriculum was supplmented by weekend projects Eric assigned, which helped us learn to build projects from scratch far earlier than senior phase. Career Success: The career success team is great. They provide lectures on interviewing, networking, salary negotiation, and so on. But the lectures are the least of what they do. First, they organize Launch Day--an event where companies looking for graduates come to the campus and interview students in a 'speed dating' style event. Though I wound up not going with any of the Launch Day companies, I did gain several good leads there. It's also a great event and a good introduction to tech interviews. More importantly, they provide you with actual support during your job search. Jackie Ore, in particular, provided tremendous support during salary negotiations--something that had always terrified me in the past. Cons: The only cons I'd say are that--at times--the Flex program did not feel like it was part of Fullstack Academy. For example, the curriculum frequently mentions deadlines for the full-time students, a source of confusion for us at times. It also felt sometimes as if the full-time staff had forgotten us. I'm sure this wasn't the case, but occasional checkins through all 6 months of the program would have helped. Aside from these minor issues, I wholeheartedly recommend Fullstack Academy. If you put in the work, you'll definitely succeed. Two months after graduating, I accepted a job offer to work as a software developer. :-)",
				"full_name": "Gabriel Rumbaut",
				"url": "https://www.coursereport.com/schools/fullstack-academy#/reviews",
				"score": 5
			},
			{
				"description": "I attended Fullstack's Flex Immersive (part-time) course from January to July 2015, as part of its first cohort. It's been over a year since I've graduated (and successfully transitioned to be a fulltime software engineer!) and judging from not only my own experience but other alums/students as well, I can confidently say that Fullstack continues to be a place of excellence that strives to help its students succeed, whatever their goals may be. First I want to mention it's really commendable that Fullstack has various options of attending, whether it's the Flex program or the remote immersive. I was really grateful Flex existed when I was looking to make a career switch (mainly for money/flexbility reasons). Running all of these cohorts in unison must be a logistical nightmare, but Fullstack pulls it off with high satisfaction.  Curriculum: Fullstack consistently iterates and improves on its product/curriculum (as all good developers do). When I attended we learned & used the MEAN stack, now it's the NERD stack. I'd advise prospective students to not be /too/ hung up on the specific technologies though - what Fullstack really teaches is the ability to pick up any technology or language and the proper methods and tools to do so effectively. Getting better at debugging and reading documentation are some of the key things I learned at Fullstack that have far longer lasting impact than specific syntax. As for Flex vs. fulltime, the curriculum was completely equal across the board, though you will most likely need to spend more time outside of class reviewing the material and/or finishing up workshops. People: Both instructors and staff at Fullstack are all incredibly friendly and open to help on whatever issues you may have. The hiring team is supportive and loves meeting and advising alums, even months or years after graduation/landing a job. Connections and relationships made at Fullstack are long-lasting and really strong, as proven by the latest alumni event which was bubbling with people and lots of hugging and chatter. No matter what your background, you will definitely meet your people here -- some of the most intelligent, curious, inquisitive and friendly people I know I've met at Fullstack. Thank you to Fullstack for providing an amazing opportunity to productively learn development and build awesome projects -- and helping make a dreamed about career switch possible.",
				"full_name": "Carolyn Yoo",
				"url": "https://www.coursereport.com/schools/fullstack-academy#/reviews",
				"score": 5
			}
		]
	}
}