{
	"program_slug": "full-stack",
	"school_slug": "hack_reactor",
	"cities": ["Austin",
		"San Francisco",
		"Los Angeles"
	],
	"focus": "SoftwareDevelopment",
	"price": {
		"financing": true,
		"finance_max_length_in_months": 60,
		"finance_min_length_in_months": null,
		"avg_usd_price_monthly": 358,
		"avg_usd_price_upfront": 17980
	},
	"time_commitment": ["part-time-inmersive", "online"],
	"learning-style": {
		"one_on_one_mentorship": true,
		"online_exercises": true,
		"description": "Live virtual classroom, lectures, video conferences. You'll attend classes 3x/week and make additional progress throughout the week with the support of staff and other learners."
	},
	"online-platform": true,
	"syllabus": {
		"topics": ["html", "css", "JavaScript", "jQuery", "NodeJS", "ExpressJS", "AJAX", "MongoDB"],
		"skills": ["Front-End Development", "Application Desing and Development"]
	},
	"mentors": {
		"industry_influencers": false
	},
	"placement_rate": 70,
	"post_graduate_support": {
		"job_support": true,
		"job_support_length_in_days": 21
	},
	"job_guarantee": {
		"refund": false,
		"defered": false
	},
	"pre_work": {
		"avg_length_in_days": null,
		"avg_length_in_hours": 80,
		"technologies": ["html", "css", "JavaScript", "jQuery"],
		"description": "Recursive Funcions, Higher Order Functions, The foundations of web development, built an interactive chat site, Github, The Command Line"
	},
	"scolarships": {
		"for_woman": true,
		"for_veterans": true,
		"other": "Underrepresented People of Color full Scholarship. Two half Scholarship for everyone"
	},
	"application_process": {
		"avg_length_in_days": 90,
		"includes_tests": true,
		"includes_interviews": true,
		"description": "You can either prepare and interview at your own pace (Only) or join in the Structured Study Program (Online) Take a live preparation, all-in-one class."
	},
	"reviews": {
		"switch_up": 4.7,
		"course_report": 4.6,
		"google": 4.8,
		"the_worse": [{
				"description": "I will phrase my review in two parts: <br /> 1.I work in financial securities, and I rigourously research all of these bootcamp schools in the same manner that my employer pays me to research stocks. <br />My analysis is that Hack Reactor is an over priced work of fiction that has a great SEO campaign and Google Adwords account that places them at the top whenever you type in 'top coding bootcamps' into Google. <br />They charge you almost 20k for materials that are available 100% free online. <br />They have so called 'Instructors' that are really just former students who were not smart enough to get a job...and the Founders are people with absolutely no verifiable professional working experience - NONE. If this was a stock I would short it.2.Has anyone else noticed the large amount of 5 star reviews? <br />Is it just my imagination or is the Hack Reactor marketing team trying to flood this blog with fake reviews? <br />There are 65 total reviews so far, and every negative review has immediately been swamped by '5 star reviews'...but they dont give their names. <br />No details are provided in these 5 star reviews...no instructor names, no course reviews, not even any reports on trying to find a job. <br />Thanks for proving everything I mentioned in this article, Hack Reactor marketing team. ",
				"full_name": "Shawn Baker",
				"url": "https://www.coursereport.com/schools/hack-reactor#/reviews",
				"score": 1
			},
			{
				"description": "Hack Reactor is not for the weak. It was not easy. It took months of self-study just to pass the entrance interview. Once accepted, there was more work to do before I was allowed in the door. All in all, I was coding near full time for four months before I started Hack Reactor. Once in, I was putting in 60+ hour weeks for three months. It was brutal. It was also not cheap. On top of the price tag, there is the cost of being unemployed for three months. I tried to work mornings while in the bootcamp, but the hours piled up and I just couldn't maintin. After graduation, I spent almost three months unemployed before I was working. I took out loans and ended up maxing out credit cards to make this happen. I was debt-free walking into Hack Reactor. Not anymore.It was devastating to my social life. There was no work-life balance. There isn't time. Hanging out with friends and family became work. I was always calculating how much going to a friend's house was going to cost me in class the next day. I have a wife and kids that I rarely saw except on Sundays. I used up a lot of social capitol that I had to rebuild. All that said, for my first job as a Software Developer I'm working at an incredible company making six figures. That goes a long way in Austin. I'll have paid off my debt in a year and a half or so on top of an upgrade in quality of life. Sure, I lost three months of my life (and six months of paychecks) and probably aged a few years, but the RoI was huge. I'm the first bootcamp graduate that my company has hired because I'm the first one that could pass their coding challenge. All bootcamps are not created equal. This one is worth it.",
				"full_name": "L. Burk McRae",
				"url": "https://www.google.com/search?q=hack%20reactor&lrd=0x80858085bdb9cd35%3A0xbdb5525f0a6d91a6%2C1%2C&rct=j&npsic=0&rflfq=1&rlha=0&rllag=37785644,-122404540,445&tbm=lcl&rldimm=13669922812103332262&ved=0ahUKEwiG5YeG2bbTAhXLSyYKHf2VBn4QvS4IQTAB&rldoc=1&tbs=lrf:!2m1!1e2!3sEAE,lf:1,lf_ui:2#lrd=0x8644b5a78559957f:0x503fdeb4937696aa,1,,,&rldoc=1&rlfi=hd:;si:5782585313716508330;mv:!3m12!1m3!1d177.22797763919607!2d-97.7410463!3d30.2698434!2m3!1f0!2f0!3f0!3m2!1i278!2i158!4f13.1",
				"score": 4.3
			}
		],
		"the_best": [{
				"description": "I had chosen Hack Reactor (Makersquare at the time I was introduced to it) after hearing about it through at least two of my friends in the Software Industry. I had originally considered getting a degree from a university and was working towards that at a community college. But when I heard about this program and it's amazing reputation in the industry, I decided to go this route. By the time I enrolled at HR, I had taken an Introduction to Programming course (coded in Python) at a community college to see if I like programming before committing. The knowledge I gained from the course helped me through the prep and the first week or two of the programming, after that it was an unfamiliar, challenging but exciting territory.Hack Reactor is great for learning programming and about yourself as an individual. This intensive 12-week program is great for those that are able to pick up things after doing the hands-on learning for 2 days and then pivot to another concept afterward. Although this type of learning style may take some adjusting on your part, after this section (first six weeks) is over, you will have a pretty good idea about how you learn as a student and how much research/practice you as an individual needs in order to understand a concept or new technology. Moving into the second half of the program, you'll be put into teams of 3-5 to work on building apps. Here, you're able to work on teamwork skills such as communication, organization, accountability, and problem solving as a group. You'll learn how to balance each team member's style of work and personality as you're going through this process. Overall, my experience at Hack Reactor was amazing and I would definitely recommend it for prospective students!",
				"full_name": "Doris Chiu",
				"url": "https://www.google.com/search?q=hack%20reactor&lrd=0x80858085bdb9cd35%3A0xbdb5525f0a6d91a6%2C1%2C&rct=j&npsic=0&rflfq=1&rlha=0&rllag=37785644,-122404540,445&tbm=lcl&rldimm=13669922812103332262&ved=0ahUKEwiG5YeG2bbTAhXLSyYKHf2VBn4QvS4IQTAB&rldoc=1&tbs=lrf:!2m1!1e2!3sEAE,lf:1,lf_ui:2#lrd=0x8644b5a78559957f:0x503fdeb4937696aa,1,,,&rldoc=1&rlfi=hd:;si:5782585313716508330;mv:!3m12!1m3!1d177.22797763919607!2d-97.7410463!3d30.2698434!2m3!1f0!2f0!3f0!3m2!1i278!2i158!4f13.1",
				"score": 5
			},
			{
				"description": "I just graduated from the remote, part-time program and had a great experience. The course is very challenging and you want to be sure you are prepared before you take the entrance exam. That's a good thing! It means that the people in your cohort deserve to be there. You will be working with them all the time, so you will learn from them and they will learn from you. The quality of the student body is one of the major reasons that I would recommend HR. The program does a good job of taking your through the basics and making sure that you cover all the important bases (databases, authentication, frontend frameworks). As it progresses you get less and less hand-holding. There's always help desk, and the tech mentors are readily available, but the idea is that by the time you graduate, you need to feel like an engineer. That means knowing how to read documentation yourself and debug like a pro. I'm graduating now with an strong sense of accomplishment and the confidence that I can pickup any framework or web technology and make it work and I couldn't ask for more. I've worked with seasoned engineers from Google during a hackathon and been a valuable asset already. Five stars, no reservations. ** Also, the part-time, remote program was perfect for me, as a full-time dad. Having 9 months to absorb all the material that folks cover in 3 months during the immersive is a serious advantage. It's also no joke. Be ready to commit all your Saturdays for 9 months straight to studying!",
				"full_name": "Chris Wohlers",
				"url": "https://www.coursereport.com/schools/hack-reactor#/reviews",
				"score": 5
			}
		]
	}
}